redis_benchmark/test/withKubearmory2_1000000.txt
====== GET ======
  1000000 requests completed in 11.91 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 2)
50.000% <= 0.295 milliseconds (cumulative count 500134)
75.000% <= 0.303 milliseconds (cumulative count 752035)
87.500% <= 0.319 milliseconds (cumulative count 904617)
93.750% <= 0.343 milliseconds (cumulative count 940516)
96.875% <= 0.415 milliseconds (cumulative count 970343)
98.438% <= 0.463 milliseconds (cumulative count 984808)
99.219% <= 0.591 milliseconds (cumulative count 992617)
99.609% <= 0.687 milliseconds (cumulative count 996211)
99.805% <= 0.791 milliseconds (cumulative count 998072)
99.902% <= 0.887 milliseconds (cumulative count 999048)
99.951% <= 1.055 milliseconds (cumulative count 999512)
99.976% <= 1.207 milliseconds (cumulative count 999770)
99.988% <= 1.471 milliseconds (cumulative count 999881)
99.994% <= 1.543 milliseconds (cumulative count 999941)
99.997% <= 1.663 milliseconds (cumulative count 999970)
99.998% <= 2.127 milliseconds (cumulative count 999985)
99.999% <= 2.143 milliseconds (cumulative count 999997)
100.000% <= 2.159 milliseconds (cumulative count 1000000)
100.000% <= 2.159 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.004% <= 0.207 milliseconds (cumulative count 42)
75.204% <= 0.303 milliseconds (cumulative count 752035)
96.732% <= 0.407 milliseconds (cumulative count 967324)
98.862% <= 0.503 milliseconds (cumulative count 988616)
99.390% <= 0.607 milliseconds (cumulative count 993903)
99.647% <= 0.703 milliseconds (cumulative count 996474)
99.839% <= 0.807 milliseconds (cumulative count 998394)
99.911% <= 0.903 milliseconds (cumulative count 999107)
99.945% <= 1.007 milliseconds (cumulative count 999449)
99.960% <= 1.103 milliseconds (cumulative count 999603)
99.977% <= 1.207 milliseconds (cumulative count 999770)
99.981% <= 1.303 milliseconds (cumulative count 999814)
99.984% <= 1.407 milliseconds (cumulative count 999835)
99.990% <= 1.503 milliseconds (cumulative count 999904)
99.996% <= 1.607 milliseconds (cumulative count 999956)
99.997% <= 1.703 milliseconds (cumulative count 999974)
99.998% <= 1.807 milliseconds (cumulative count 999978)
100.000% <= 3.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 83948.96 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.306     0.112     0.295     0.367     0.535     2.159