redis_benchmark/test/withPolicy3_1000000.txt
====== GET ======
  1000000 requests completed in 0.66 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 28.415 milliseconds (cumulative count 1000)
50.000% <= 349.695 milliseconds (cumulative count 503000)
75.000% <= 368.383 milliseconds (cumulative count 753000)
87.500% <= 376.575 milliseconds (cumulative count 875000)
93.750% <= 380.671 milliseconds (cumulative count 938000)
96.875% <= 383.231 milliseconds (cumulative count 969000)
98.438% <= 384.255 milliseconds (cumulative count 985000)
99.219% <= 385.279 milliseconds (cumulative count 994000)
99.609% <= 399.103 milliseconds (cumulative count 998000)
99.805% <= 399.359 milliseconds (cumulative count 1000000)
100.000% <= 399.359 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
1.100% <= 29.103 milliseconds (cumulative count 11000)
1.500% <= 30.111 milliseconds (cumulative count 15000)
2.500% <= 99.135 milliseconds (cumulative count 25000)
4.100% <= 100.159 milliseconds (cumulative count 41000)
5.500% <= 101.119 milliseconds (cumulative count 55000)
7.100% <= 102.143 milliseconds (cumulative count 71000)
8.600% <= 103.103 milliseconds (cumulative count 86000)
9.900% <= 104.127 milliseconds (cumulative count 99000)
10.900% <= 113.151 milliseconds (cumulative count 109000)
12.300% <= 114.111 milliseconds (cumulative count 123000)
13.800% <= 115.135 milliseconds (cumulative count 138000)
15.000% <= 116.159 milliseconds (cumulative count 150000)
16.500% <= 117.119 milliseconds (cumulative count 165000)
18.000% <= 118.143 milliseconds (cumulative count 180000)
19.500% <= 119.103 milliseconds (cumulative count 195000)
21.100% <= 120.127 milliseconds (cumulative count 211000)
22.700% <= 121.151 milliseconds (cumulative count 227000)
23.500% <= 122.111 milliseconds (cumulative count 235000)
25.100% <= 123.135 milliseconds (cumulative count 251000)
25.500% <= 124.159 milliseconds (cumulative count 255000)
26.900% <= 127.103 milliseconds (cumulative count 269000)
28.200% <= 128.127 milliseconds (cumulative count 282000)
29.600% <= 334.335 milliseconds (cumulative count 296000)
30.800% <= 335.103 milliseconds (cumulative count 308000)
32.300% <= 336.127 milliseconds (cumulative count 323000)
33.600% <= 337.151 milliseconds (cumulative count 336000)
35.100% <= 338.175 milliseconds (cumulative count 351000)
36.400% <= 339.199 milliseconds (cumulative count 364000)
37.900% <= 340.223 milliseconds (cumulative count 379000)
39.500% <= 341.247 milliseconds (cumulative count 395000)
41.100% <= 342.271 milliseconds (cumulative count 411000)
42.200% <= 343.295 milliseconds (cumulative count 422000)
43.300% <= 344.319 milliseconds (cumulative count 433000)
44.700% <= 345.343 milliseconds (cumulative count 447000)
45.800% <= 346.111 milliseconds (cumulative count 458000)
47.400% <= 347.135 milliseconds (cumulative count 474000)
48.400% <= 348.159 milliseconds (cumulative count 484000)
49.700% <= 349.183 milliseconds (cumulative count 497000)
51.100% <= 350.207 milliseconds (cumulative count 511000)
51.600% <= 351.231 milliseconds (cumulative count 516000)
52.500% <= 352.255 milliseconds (cumulative count 525000)
53.400% <= 353.279 milliseconds (cumulative count 534000)
55.000% <= 354.303 milliseconds (cumulative count 550000)
56.600% <= 355.327 milliseconds (cumulative count 566000)
58.100% <= 356.351 milliseconds (cumulative count 581000)
59.300% <= 357.119 milliseconds (cumulative count 593000)
60.800% <= 358.143 milliseconds (cumulative count 608000)
62.400% <= 359.167 milliseconds (cumulative count 624000)
63.500% <= 360.191 milliseconds (cumulative count 635000)
65.000% <= 361.215 milliseconds (cumulative count 650000)
66.500% <= 362.239 milliseconds (cumulative count 665000)
67.500% <= 363.263 milliseconds (cumulative count 675000)
69.100% <= 364.287 milliseconds (cumulative count 691000)
70.600% <= 365.311 milliseconds (cumulative count 706000)
72.200% <= 366.335 milliseconds (cumulative count 722000)
73.300% <= 367.103 milliseconds (cumulative count 733000)
74.900% <= 368.127 milliseconds (cumulative count 749000)
76.400% <= 369.151 milliseconds (cumulative count 764000)
78.100% <= 370.175 milliseconds (cumulative count 781000)
79.600% <= 371.199 milliseconds (cumulative count 796000)
80.900% <= 372.223 milliseconds (cumulative count 809000)
82.400% <= 373.247 milliseconds (cumulative count 824000)
84.000% <= 374.271 milliseconds (cumulative count 840000)
85.600% <= 375.295 milliseconds (cumulative count 856000)
87.100% <= 376.319 milliseconds (cumulative count 871000)
88.700% <= 377.343 milliseconds (cumulative count 887000)
89.800% <= 378.111 milliseconds (cumulative count 898000)
91.400% <= 379.135 milliseconds (cumulative count 914000)
93.000% <= 380.159 milliseconds (cumulative count 930000)
94.600% <= 381.183 milliseconds (cumulative count 946000)
95.600% <= 382.207 milliseconds (cumulative count 956000)
96.900% <= 383.231 milliseconds (cumulative count 969000)
98.500% <= 384.255 milliseconds (cumulative count 985000)
99.400% <= 385.279 milliseconds (cumulative count 994000)
99.500% <= 386.303 milliseconds (cumulative count 995000)
99.800% <= 399.103 milliseconds (cumulative count 998000)
100.000% <= 400.127 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 1506024.12 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
      289.204    28.400   349.695   381.439   385.023   399.359